'use strict';
 //литерал (не меняется,ибо если поменять, то будет уже другое значение)
 // десятичный,
//infinity - бесконечное число,
//NaN - Не число (индикатор,который помогает понять, что не так)
//let a = true;
//let a = null; число, которое не существует
// let a = underfiend; свойство, когда не дает обозначение переменной
//let a = simbol()
let incr = 10,
    decr = 10;


  console.log(++incr);
    console.log(--decr);

var a = 5;
console.log(a);
<p>
</p>


// let answer = confirm("are you here?");
//
// console.log(answer)


//else - иначе (блок по умолчанию), если блок if возвращает ложь,
//то блок с иначе будет выполнен вместо него
//|-или
 //&&- и
 //if-есл
 //if true
 //if false
 //положительные числа - это истина
 //пустая строка и 0 это ложь
 // 2 ровные палоки - или
 //&& оператор "и" должны быть 2 истины
 // || "или" может быть одна истина
 // else if...
 //function можем вызывать там где хотим,содержится код для решения конкретной задачи
